In [14]:
import pandas as pd
import matplotlib.pyplot as plt

In [27]:
import warnings
warnings.filterwarnings("ignore")

# reading excel

In [28]:
import openpyxl
data=pd.read_excel('/home/placement/Downloads/continents1.xlsx',engine='openpyxl')

In [29]:
data

     country    lat    lon  langguage
0    Austria  47.68  13.33    English
1      India  22.00  78.00      hindi
2     Bejium  50.83   4.67    english
3    germany  51.15  10.43     german
4     norway  64.00  18.30     engish
5  sri lanka   7.66  80.63  simhalase

In [30]:
data.head(10)

     country    lat    lon  langguage
0    Austria  47.68  13.33    English
1      India  22.00  78.00      hindi
2     Bejium  50.83   4.67    english
3    germany  51.15  10.43     german
4     norway  64.00  18.30     engish
5  sri lanka   7.66  80.63  simhalase

In [31]:
sai=data.drop(['langguage','country'],axis=1)
sai

     lat    lon
0  47.68  13.33
1  22.00  78.00
2  50.83   4.67
3  51.15  10.43
4  64.00  18.30
5   7.66  80.63

In [32]:
x=sai
x

     lat    lon
0  47.68  13.33
1  22.00  78.00
2  50.83   4.67
3  51.15  10.43
4  64.00  18.30
5   7.66  80.63

# clusters 2

In [43]:
from sklearn.cluster import KMeans
Kmeans=KMeans(n_clusters=2)
ypred=Kmeans.fit_predict(x)
ypred=Kmeans.predict(x)

In [44]:
ypred

array([1, 0, 1, 1, 1, 0], dtype=int32)

In [45]:
data['category']=ypred
data

     country    lat    lon  langguage  category
0    Austria  47.68  13.33    English         1
1      India  22.00  78.00      hindi         0
2     Bejium  50.83   4.67    english         1
3    germany  51.15  10.43     german         1
4     norway  64.00  18.30     engish         1
5  sri lanka   7.66  80.63  simhalase         0

# clusters 3

In [46]:
from sklearn.cluster import KMeans
Kmeans=KMeans(n_clusters=3)
ypred=Kmeans.fit_predict(x)
ypred=Kmeans.predict(x)

In [47]:
ypred

array([2, 1, 2, 2, 0, 1], dtype=int32)

In [48]:
data['category']=ypred
datadata['category']=ypred
data

     country    lat    lon  langguage  category
0    Austria  47.68  13.33    English         2
1      India  22.00  78.00      hindi         1
2     Bejium  50.83   4.67    english         2
3    germany  51.15  10.43     german         2
4     norway  64.00  18.30     engish         0
5  sri lanka   7.66  80.63  simhalase         1